0/U
FoamFile{version 2.0; format ascii; class volVectorField; location "0"; object U;}
dimensions [0 1 -1 0 0 0 0];
internalField uniform (8 0 0);
boundaryField{xMin{type cyclic;}xMax{type cyclic;}yMin{type cyclic;}yMax{type cyclic;}bottom{type fixedValue; value uniform (0 0 0);}top{type slip;}}
