0/flm
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      flm;
}
dimensions      [0 4 -4 0 0 0 0];

internalField   uniform 1;   // seed nonzero so invT is not stuck at 0

boundaryField
{
    xMin    { type cyclic; }
    xMax    { type cyclic; }
    yMin    { type cyclic; }
    yMax    { type cyclic; }
    bottom  { type zeroGradient; }
    top     { type zeroGradient; }
}
