0/nut
FoamFile{version 2.0; format ascii; class volScalarField; location "0"; object nut;}
dimensions [0 2 -1 0 0 0 0];
internalField uniform 0;
boundaryField{xMin{type cyclic;}xMax{type cyclic;}yMin{type cyclic;}yMax{type cyclic;}bottom{
  type atmNutUWallFunction;
  z0 uniform 0.01;
  kappa 0.41;
  boundNut true;
  value uniform 0;
}top{type zeroGradient;}}
