0/p
FoamFile{version 2.0; format ascii; class volScalarField; location "0"; object p;}
dimensions [0 2 -2 0 0 0 0];
internalField uniform 0;
boundaryField{xMin{type cyclic;}xMax{type cyclic;}yMin{type cyclic;}yMax{type cyclic;}bottom{type zeroGradient;}top{type zeroGradient;}}
