system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| OpenFOAM: The Open Source CFD Toolbox                                      |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}

// NOTE: run_les.sh overwrites this file with either controlDict.spinup or
// controlDict.capture before launching the solver.
application     pimpleFoam;

startFrom       startTime;
startTime       0;

stopAt          endTime;
endTime         33;

deltaT          0.2;
adjustTimeStep  yes;
maxCo           0.7;
maxDeltaT       0.5;

writeControl    runTime;
writeInterval   0.5;
purgeWrite      0;

writeFormat     ascii;
writePrecision  8;
writeCompression off;

timeFormat      general;
timePrecision   8;

runTimeModifiable yes;

functions
{
    wallShear
    {
        type            wallShearStress;
        libs            ("libfieldFunctionObjects.so");
        patches         (bottom);

        writeControl    runTime;
        writeInterval   0.5;
    }
}
