system/decomposeParDict
FoamFile{version 2.0; format ascii; class dictionary; object decomposeParDict;}
numberOfSubdomains 1;
method scotch;
distributed no;
roots();
