system/functions/wallShear
wallShear
{
    type            wallShearStress;
    libs            ("libfieldFunctionObjects.so");
    patches         (bottom);

    writeControl    runTime;
    writeInterval   0.5;
}
