system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           |                                                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}

solvers
{
    p
    {
        solver          GAMG;
        tolerance       1e-7;
        relTol          0.01;

        smoother        GaussSeidel;
        nPreSweeps      0;
        nPostSweeps     2;
        nFinestSweeps   2;

        cacheAgglomeration true;
        agglomerator    faceAreaPair;
        nCellsInCoarsestLevel 20;
        mergeLevels     1;
    }

    pFinal
    {
        $p;
        relTol          0;
    }

    U
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-8;
        relTol          0.1;
    }

    UFinal
    {
        $U;
        relTol          0;
    }

    // dynamicLagrangian auxiliary fields (you already have 0/flm and 0/fmm)
    flm
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-10;
        relTol          0;
    }

    fmm
    {
        $flm;
    }

    // REQUIRED by v2412 on the final correction step
    flmFinal
    {
        $flm;
        relTol          0;
    }

    fmmFinal
    {
        $fmm;
        relTol          0;
    }
}

PIMPLE
{
    nOuterCorrectors         2;
    nCorrectors              2;
    nNonOrthogonalCorrectors 0;
    pRefCell    0;
    pRefValue   0;

    momentumPredictor        yes;
    correctPhi               yes;
    turbOnFinalIterOnly      no;
}

relaxationFactors
{
    fields
    {
        p   0.3;
    }
    equations
    {
        U   0.7;
    }
}
